{
    "_id": {
      "$oid": "691cee06d10432b7f94727cf"
    },
    "parents": [
      "15Ulav8PFhiaYEaiW5v6h8rBMpqutxXpl"
    ],
    "id": "19x87oYzQdf498CwVZnj2YuH3NSHKkOBAmX_a0WsniKk",
    "name": "Ooo: airdrop page_Ale, Monica - 2025/07/09 18:29 KST - Gemini가 작성한 회의록",
    "mimeType": "application/vnd.google-apps.document",
    "webViewLink": "https://docs.google.com/document/d/19x87oYzQdf498CwVZnj2YuH3NSHKkOBAmX_a0WsniKk/edit?usp=drivesdk",
    "createdTime": "2025-07-09T10:08:16.710Z",
    "modifiedTime": "2025-11-12T08:49:57.319Z",
    "driveId": "0AK6W4i05tbovUk9PVA",
    "size": "25090",
    "content": "﻿📝 회의록\r\n2025년 7월 9일\r\nOoo: airdrop page_Ale, Monica\r\n초대됨 Monica Kim Ale Son\r\n첨부파일 Ooo: airdrop page_Ale, Monica \r\n회의 관련 기록 스크립트 녹화 중 \r\n\r\n\r\n요약\r\nAle Son과 Monica Kim은 웹사이트 및 모바일 GNB를 상단에 고정하는 것에 동의했으며, Monica Kim이 작성한 메인 카피는 Dek과 메이드에게 검토 요청하기로 했습니다. Google Form 내용에 대한 논의에서 Ale Son은 사용자가 본인의 계정 ID와 공유 링크를 첨부하고 팔로우 여부만 확인하는 방식을 제안했으며, Jake Jang과의 논의를 통해 사용자가 생성된 프루프 파일을 Google Form에 업로드하면 팀에서 이를 모아 온체인으로 대신 증명하는 방식으로 제출 방식이 확정되었습니다. Monica Kim은 노션과 웹 콘텐츠를 일치시킨 후 리뷰 요청, 온체인 제출 가이드 및 Google Form 준비를 남은 업무로 정리했습니다.\r\n\r\n\r\n세부정보\r\n* 웹사이트 및 모바일 GNB 업데이트 Ale Son은 웹사이트와 모바일 모두에서 GNB(글로벌 내비게이션 바)를 상단에 고정하는 것에 동의했습니다 (00:00:00). Monica Kim은 펭수 웹사이트처럼 스크롤 시 GNB를 노출하는 방안도 고려했지만, Ale Son은 디자인 측면에서 GNB 고정이 더 깔끔하다고 판단했습니다. 특히 모바일 환경에서 사용자들이 더 많이 이용할 것으로 예상했기 때문입니다 (00:01:19).\r\n* URL 노출 및 메인 카피 검토 Monica Kim은 웹사이트 URL 노출 시 탭의 아이콘(비콘)을 변경해야 한다고 언급했고, Ale Son은 기존에 사용하던 것으로 변경하겠다고 했습니다. 메인 카피는 Monica Kim이 작성했으며, Ale Son은 해당 텍스트를 Dek과 메이드에게 검토 요청할 것을 제안했습니다. 또한, 두 가지 내용을 합쳐야 하는 부분이 있어 수정이 필요하다고 덧붙였습니다 (00:02:15).\r\n* 피그마 파일을 통한 피드백 및 콘텐츠 검토 Monica Kim은 피그마 파일을 통해 피드백을 남기겠다고 제안했고, Ale Son은 다른 팀원들의 추가 리뷰가 필요하다고 언급했습니다. 현재 작성된 콘텐츠는 Monica Kim이 GPT와 논의하여 임의로 작성한 것이므로, 이 내용을 확정하기 전에 주간 회의에서 논의하거나 리뷰를 요청할 예정입니다 (00:03:29).\r\n* 퀘스트 내용 및 주의사항 조정 Ale Son은 지난 주 회의에서 논의된 내용을 바탕으로 구체적인 퀘스트 내용을 줄이고 리뷰를 요청할 것이라고 밝혔습니다. Monica Kim은 이벤트 진행 시 변경될 수 있는 주의사항과 보상 내용에 대한 유연성을 강조했으며 (00:04:37), Ale Son은 이러한 변경이 디자인에 큰 영향을 미치지 않을 것이라고 판단했습니다 (00:05:52).\r\n* Google Form 내용 확정 및 프루프 제출 방식 논의 Google Form에 어떤 내용을 포함할지에 대한 논의가 이루어졌습니다. Ale Son은 사용자가 본인의 계정 ID와 공유 링크를 첨부하도록 하여 팔로우 여부만 확인하는 방식으로 검수할 수 있다고 제안했습니다 (00:07:41). 또한, Monica Kim은 Google Form에 퀴즈 내용을 추가할 것이며, Ale Son은 Form 질문을 구성할 때 모니카 님과 자신이 1차 검수를 진행할 것임을 언급했습니다 (00:08:47).\r\n* 온체인 프루프 제출 방식 구체화 Ale Son과 Monica Kim은 플레이그라운드에서 생성된 프루프를 온체인으로 제출하는 방식에 대해 논의했습니다 (00:08:47). 초기에는 이더스캔을 통해 트랜잭션 해시를 제출하는 방식이 논의되었으나, 이는 사용자에게 가스비를 발생시킬 수 있다는 우려가 제기되었습니다 (00:09:51). Jake Jang과의 논의를 통해 사용자가 생성된 프루프 파일을 Google Form에 업로드하면, 팀에서 이를 모아 온체인으로 대신 증명하는 방식이 확정되었습니다 (00:23:28).\r\n* Google Form 파일 업로드 보안 및 사용자 가이드라인 Jake Jang은 Google Form에 파일을 업로드할 때 바이러스 검사가 자동으로 이루어지는지 확인할 필요가 있다고 강조했습니다. Ale Son은 구글 드라이브와 유사한 방식으로 파일 형식을 제한하여 보안을 강화하고 있음을 설명했습니다 (00:30:17). 또한, Jake Jang은 FAQ에 \"우리 앱을 믿을 수 있는가?\"라는 질문을 추가하고, 오프라인에서도 앱 사용이 가능함을 명시하여 사용자의 불안감을 해소해야 한다고 제안했습니다 (00:32:01).\r\n* 프루프 메뉴에 제출자 정보 추가 Monica Kim은 프루프 메뉴에서 사용자가 자신의 증명 내역을 확인할 수 있도록 지갑 주소 필드를 추가해야 한다고 제안했습니다 (00:28:22). Jake Jang은 \"지갑 주소\" 대신 \"제출자\"라는 명확한 용어를 사용하여 혼동을 피할 것을 권고했습니다 (00:29:17).\r\n* 남은 업무 정리 및 진행 계획 Monica Kim은 남은 업무로 노션과 웹 콘텐츠를 일치시킨 후 리뷰를 요청하는 것과, 온체인 제출 가이드 및 Google Form을 준비하는 것을 정리했습니다. Ale Son은 가이드 작성을 담당하고, Monica Kim은 Google Form 작성을 담당하기로 했습니다 (00:13:45). Ale Son은 내부 테스트를 통해 버그를 잡고, 특히 윈도우 환경에서의 테스트를 강조했습니다 (00:16:25).\r\n* 버튼명 및 모달 메시지 개선 Monica Kim은 플레이그라운드의 모달에서 버튼명을 명확히 해야 한다고 제안했습니다 (00:33:14). Ale Son은 \"다운로드\" 버튼을 통해 프루프 파일을 다운로드하고, 다운로드 완료 후 \"제출\" 버튼이 활성화되는 방식이 더 명확할 것이라고 동의했습니다. 또한, 모달에 파일을 다운로드하여 첨부해야 한다는 설명 문구를 추가하여 사용자에게 명확한 지시를 제공하기로 했습니다 (00:34:16).\r\n\r\n\r\nGemini가 작성한 회의록이 정확한지 검토해야 합니다. Gemini가 회의록을 작성하는 방법에 관한 도움말을 알아보세요.\r\n회의록 작성 시의 Gemini 사용에 관한 의견을 짧은 설문조사입니다.\r\n📖 스크립트\r\n2025년 7월 9일\r\nOoo: airdrop page_Ale, Monica - 스크립트\r\n00:00:00\r\n \r\nAle Son: 안녕하세요.\r\nMonica Kim: 안녕하세요.\r\nAle Son: 네. 네. 혹시 공유 해 드린 거 보셨나요?\r\nMonica Kim: 아,\r\nAle Son: 사이트.\r\nMonica Kim: 네. 봤어요.\r\nAle Son: 예.\r\nMonica Kim: 네, 봤어요.\r\nAle Son: 어, 잠시만요.\r\nMonica Kim: 근데 아직 그 768 반영 안 된 거가 맞는 거죠?\r\nAle Son: 출력 파일이요?\r\nMonica Kim: 그 768 아까 그 공유드\r\nAle Son: 아, 네. 네. 네. 네.\r\nMonica Kim: 사이즈. 아, 네.\r\nAle Son: 새로 추가된 거는 이제 추가하려고\r\nMonica Kim: 네.\r\nAle Son: 합니다.\r\nMonica Kim: 그 그거랑 그 뭐지? 스크롤 할 때\r\nAle Son: 네.\r\nMonica Kim: 그\r\nAle Son: 네.\r\nMonica Kim: 스크롤 내릴 때 GNB 상단에 보이는 거\r\nAle Son: 잠시만요. 제가 사이트를 공유할게요.\r\nMonica Kim: 네.\r\nAle Son: 하단에 GNB가 어떤 거 말씀하신 거죠?\r\nMonica Kim: 그 상단에 메뉴요. 그 로고랑 그 GB 네. 이거 이렇게 스크롤 다운할 때\r\nAle Son: 아, 위에 고정\r\nMonica Kim: 네.\r\n \r\n \r\n00:01:19\r\n \r\nAle Son: 시켜야\r\nMonica Kim: 네.\r\nAle Son: 되.\r\nMonica Kim: 네.\r\nAle Son: 아,\r\nMonica Kim: 네.\r\nAle Son: 네. 네. 알겠습니다. 모바일도 똑같이 하면 될까요?\r\nMonica Kim: 근데 원래 그 펭수 그때 공유해 주셨던데 있잖아요.\r\nAle Son: 네. 네.\r\nMonica Kim: 그것처럼 이렇게 스크롤 올릴 때 그걸 노출 하는 걸 생각했는데 뭐 둘 다 괜찮아서 그 편하신 걸 해 주셔도 돼. 그\r\nAle Son: 음.\r\nMonica Kim: 펭수네임처럼 해 주셔도 되고 아니면 그냥 스크롤 다운했을 때\r\nAle Son: 아,\r\nMonica Kim: 그냥 상단에 붙여 주셔도 되고\r\nAle Son: 네. 그럼 고정하는 걸로 할게요. 저희 디자인은 그게 좀 더\r\nMonica Kim: 네.\r\nAle Son: 시풀하게는 거 같아서. 예. 얘가\r\nMonica Kim: 네.\r\nAle Son: 붙어 있는게 좋을 것 같아요. 모바일로 더 많이 볼 것 같거든요. 예.\r\nMonica Kim: 네. 네.\r\nAle Son: 어\r\nMonica Kim: 그 그거랑 사실 뭐 안에 디테일한 거는 크게 볼 거 없는데 저희\r\n \r\n \r\n00:02:15\r\n \r\nAle Son: 예.\r\nMonica Kim: 그 이거 URL을 노출될 때는 저걸 뭐라 그러지? 그 탭 위에 앞에 그 지구분\r\nAle Son: 아 비콘이에요?\r\nMonica Kim: 아네네네\r\nAle Son: 네네.\r\nMonica Kim: 네\r\nAle Son: 이거 바꾸면 카맨날 쓰던 걸로 바꾸면 되죠.\r\nMonica Kim: 아네네\r\nAle Son: 이거\r\nMonica Kim: 맞아요 맞아요네\r\nAle Son: 그다음에 아 타이틀은 뭐 내일 제이크한테 물어보면 한번 바꿀게요. 예. 디스크립션 저될 거 같고\r\nMonica Kim: 그래 근데 이런 그런 메인 카피 같은 것도 제가 쓴 건데 그때 토카막 지키게 이렇게 EVM 내용이 있으면 좋겠다고 하셔 가지고\r\nAle Son: 네. 네.\r\nMonica Kim: 네. 그래서 이거 텍스트 같은 것도 전체적으로 한번 리뷰를 해. 제가 누구한테 요청을 드려야 되죠? 저는 알네\r\nAle Son: 뭐 드크랑 메이드한테 한번 봐 달라 하면 되지 않을까요? 예.\r\nMonica Kim: 아 네네\r\nAle Son: 그 어차피 조금 이제 바꿔야 되는게 여기는 그때 두 개를 합치기로 해서 예.이 이 부분 고쳐야 될 거 같고 나머지는음\r\n \r\n \r\n00:03:29\r\n \r\nMonica Kim: 어 제가 피그마 파일로 해 봐도 돼요 그래서 제가 바로바로 코멘트 남길게요.\r\nAle Son: 아 예예 아마 이쪽 다른 테스트들을 한번 더 리뷰를 한번 받아봐야 될 것 같아 예체적으로\r\nMonica Kim: 네.\r\nAle Son: 예\r\nMonica Kim: 저희끼리 지금 얘기하고 리뷰 요청할 거는음 하는 걸로 다시\r\nAle Son: 네네 그러면 그러면 뭐 디자인 한 번만 봐 주시고\r\nMonica Kim: 네.\r\nAle Son: 칠 때 피드백 남겨 주시면 반영할게요. 예.\r\nMonica Kim: 어. 근데이 안에 이거 내가 제가 그때 다 임의로 저희끼리 얘기했을 때 그 GPT랑 얘기하면서 임의로 다 작금 지금 화면 보이세요?\r\nAle Son: 네. 네.\r\nMonica Kim: 네. 임의로 작성한 건데 그이 내용을 저희끼리 일단 정하지 말고 그러면 그냥 리뷰 요청을 해 하는 걸 어떻게 구체적으로\r\nAle Son: 어,\r\nMonica Kim: 사실네\r\nAle Son: 내일 어차피 콜이 있으니까 내일 위클리 콜에서 한번 얘기를 해 보시죠. 제가 다시 예, 근데 뭐 저번에 저번 주에 기획했던 내용에서 아주 엄청 크게 바뀔 건 없는 거 같고요.\r\n \r\n \r\n00:04:37\r\n \r\nAle Son: 다만 그 뭐죠?\r\nMonica Kim: 근데\r\nAle Son: 그\r\nMonica Kim: 이런 거 이런 거 빼 뺄까요? 빼 둘까요? 일단 이거 뭐 빼는 건 어려운게 아니어서\r\nAle Son: 네.\r\nMonica Kim: 네. 그래서 기획적으로 지금 안 된게 어 이런 구체적인 퀘스트돼요. 뭐 이런 거 다 할 건지 뭐 한 개만 할 건지 뭐 이런 거니까 이거를 어느 성까지 저희가 정 하는지 정확하게 잘 모르겠어 가지고\r\nAle Son: 음. 이거는 저희가 저번 주에 기획 얘기했던 내용 바탕으로 한번 줄이고 그다음에\r\nMonica Kim: 네.\r\nAle Son: 유를 요청하면 될 거 같아요. 뭐 네. 많이 바뀔 거 없을 것 같고.\r\nMonica Kim: 네. 네.\r\nAle Son: 네. 네.\r\nMonica Kim: 그리고 이런 주의 사항도 저는 약간 진짜로 이벤트를 할 때가 되면은 또 뭐 무슨 뭐가 생기고 분명히 변경될 거라고 생각을 하거든요.\r\nAle Son: 네. 네.\r\nMonica Kim: 그래서 여기도 뭐 이거 저희 처음에 얘기했던 내용이지만 뭐 충분히 바뀔 여지가 있는 부분 사실 FQ랑 프루프 뭐 이런 거 빼고는 안에 내용은 사실 바뀔 수 있는 거잖아요.\r\n \r\n \r\n00:05:52\r\n \r\nMonica Kim: 충분히 보상이 뭐 적어지면은 이것도 뭐 달라질 수도 있고요.\r\nAle Son: 음. 제가 볼 때 아마 다음 주에 결정이 될 거 같은데 그때 무린카 님이 안 계시니까 어 차 이런 거는 뭐 사실 뭐 저희가 테이블 길이 자체가 그냥 높아졌다 낮아졌다 하니까 뭐 이쪽에 내용이 추가되고 빠지는 거는 크게 제가 볼 때\r\nMonica Kim: 어,\r\nAle Son: 디자인적인 이슈는 다 없을 것 같고 이거 노트에만 만약이\r\nMonica Kim: 네.\r\nAle Son: 노트가 짧아질 수 있잖아요 그러면은 아,\r\nMonica Kim: 노트가 짧았다는게\r\nAle Son: 네. 네.\r\nMonica Kim: 무슨 일이에요?이\r\nAle Son: 네. 뭐,\r\nMonica Kim: 길이가 예를 들어서\r\nAle Son: 네.\r\nMonica Kim: 이렇게\r\nAle Son: 테이블\r\nMonica Kim: 짧아.\r\nAle Son: 높이가 뭐 지금 다섯 개인데\r\nMonica Kim: 네.\r\nAle Son: 아, 근데 뭐 이것도 높이가 줄어든만큼 그냥 여기\r\nMonica Kim: 네.이\r\nAle Son: 컨테이너를\r\nMonica Kim: 이런\r\nAle Son: 줄이면 되니까\r\nMonica Kim: 줄이고 얘만 이렇게 올려 주시면\r\n \r\n \r\n00:06:45\r\n \r\nAle Son: 이게\r\nMonica Kim: 돼서 사실 제가\r\nAle Son: 음.\r\nMonica Kim: 일부러이 안에는 계속 변경될 거라 생각해서 뭐 최대한 간단하게 자고업 해 놨거든요.\r\nAle Son: 네. 네. 뭐\r\nMonica Kim: 둘\r\nAle Son: 크게 상관없을 것 같아요. 다 컨테이너 크기가 유동적으로 변할 수 있어 가지고. 예. 뭐 이거는 제가 그냥 임의대로 할게요. 예. 내용 길이가 달라진 대로. 예.\r\nMonica Kim: 그러면은 저는음 리뷰 요청하기 전에 그 알렌 님이 그 노션에 정리해 두신 거 그 내용 한번 비교해서 반영이 잘 되었는지 확인을 해 볼게요.\r\nAle Son: 어. 예. 지금 저희 노션 내용이랑 조금 다른게 있어서 예.\r\nMonica Kim: 네.\r\nAle Son: 그거\r\nMonica Kim: 아마 조금 있을 거 완전\r\nAle Son: 예.\r\nMonica Kim: 초안하고 했던 거라. 어. 아, 근데\r\nAle Son: 네.\r\nMonica Kim: 그\r\nAle Son: 네.\r\nMonica Kim: 구글 폼 내용을 정해야 될 거 같아서요.\r\nAle Son: 아, 예. 예.\r\n \r\n \r\n00:07:41\r\n \r\nMonica Kim: 그 구글 폼에 뭐가 들어갈지 어떤 걸 요구할지 뭐.\r\nAle Son: 음. M네\r\nMonica Kim: 뭐 지갑 주소랑 뭐 뭐 당연히이 퀘스트 인증하는 거겠죠. 근데 전 좀 생각해 본게 아 생각해 보니까 SNS 이거를 이제 하잖아요. 뭐네 개든 다섯 개든. 근데 그러면 저희가 그 사람 계정을 알려주면은 그 계정이 그렇게 팔로우를 했는지 포스트를 리트스를 했는지 뭐 이런 걸 다 확인을 해야 해야 하겠데.\r\nAle Son: 그 폼에 폼에 의 그 본인의 계정 아이디랑\r\nMonica Kim: 네.\r\nAle Son: 뭐 예를 들어서 쉐어하고 코멘트 달면은 그 링크 딸 수 있잖아요. 그거를\r\nMonica Kim: 아.\r\nAle Son: 첨부하게 하면 될 거 같아요. 그럼 저희는 팔로우만 하긴 하면 되니까.\r\nMonica Kim: 음. 그러면 제가 옆에다가 노트 해 둘까요? 구글 구글 폼에 들어갈\r\nAle Son: 네.\r\nMonica Kim: 거.\r\nAle Son: 구글 폼.\r\n \r\n \r\n00:08:47\r\n \r\nAle Son: 네. 저희 보드에 맞춰서 구성을 역으로 하면 될 거 같아요. 예. 키즈만 어\r\nMonica Kim: 퀴즈도 이거 FQ 내용 다 제일 큰 님한테 확인 받은 거라이 안에서이 퀴즈는 뭐 제가 낼게요. 이거\r\nAle Son: 네네\r\nMonica Kim: 이걸 안에 있는 걸로 답 여기 있는 걸로 하면 돼서\r\nAle Son: 어차피 폼을 받으면은 모인카님 저랑 1차 검수를 할 것 같아서 예 저희\r\nMonica Kim: 네.\r\nAle Son: 일하는 상태에 맞게 질문 구성을 하면 될 거 같아요.\r\nMonica Kim: 네. 그러면 구글 폼은 우선 아 근데 이게 전 다른 거가 문제 아니라 그 인증하는게 그때 뭐 트랜잭션 해시로 인증을 남 그네\r\nAle Son: 음. 네. 지금 보면은 아마 계획이 바뀌지 않으면 플레이그라운드에서 그때 모달 추가해 주신 거 있잖아요. 예.\r\nMonica Kim: 네.\r\nAle Son: 그걸 통해서\r\nMonica Kim: 네.\r\nAle Son: 어 유저와 생성한 프로를 이제 온체인으로 보내면은 그 보낸 트랜잭션 해시가 남을 거예요.\r\n \r\n \r\n00:09:51\r\n \r\nAle Son: 예. 거기에\r\nMonica Kim: 그\r\nAle Son: 대한 아 근데\r\nMonica Kim: 그게\r\nAle Son: 이거\r\nMonica Kim: 여기는 거죠.\r\nAle Son: 그거를 이제 품에다 남겨야겠죠. 예\r\nMonica Kim: 아, 여기 들어가는 트랜잭션 해시를 작성을 해야겠 달라고 해야겠네요.\r\nAle Son: 완료했으면은 그 아 근데 이게 메인내서 하게 되면 그 가스비 얼마나 될지 모르겠네. 예. 돈 내면서 참여를 해야 되니까 일단\r\nMonica Kim: 어, 근데 저 좀 제가 좀 이해가 안 되는게 저희 거 앱을 설치를 했어요. 그래서 물 탱크로 이제 1이 나왔어요.\r\nAle Son: 네.\r\nMonica Kim: 그다음에 그 온체인으로 어떻게 보낸다는 거예요?\r\nAle Son: 그 메디가 그때 링크 공유한게 있는데 이더 스캔에서 그냥 하는 거예요. 예.\r\nMonica Kim: 어\r\nAle Son: 링크가\r\nMonica Kim: 그때 잠깐 보여 주셨던 막 베리파이 그 이더 스캔에서 그렇게 하는\r\nAle Son: 네.\r\nMonica Kim: 그런데 그게 이게 뭐 완전 비발 저처럼 모르는 사람들 대상은 아니라고 했으니까 까네\r\n \r\n \r\n00:11:03\r\n \r\nAle Son: 그 여기 아마이 함수 거예요. 예.앤 커믹스 업데이트. 아마 여기 뭐 파라미터 여러 개데 이거는 자동으로 채워질 거고 유적할 거는 이제 커넥트하고 그다음에 라이트 쓰는 거. 예. 두 개.\r\nMonica Kim: 그러면 이거에 대한 안내를 해야 되는 거 아니에요? 이거 맞네. 안 해도 다 아는 거예요. 저는\r\nAle Son: 안내\r\nMonica Kim: 모는데.\r\nAle Son: 가이드가 있긴 해야겠죠. 여기에 대한 예 근데네 근데 아마이 정도 참여할 GK라는 걸 드러는 받고 참여할 사람이면은 이더 스캔 인터페이스를 할 수는 있을 텐데 어쨌든 추가를 해야 되는데 어 저희가 노션이나 이런데 그냥 간략하게 전체 가이드를 해 놓고 거기다가 추가를 해야 되지 않을까 싶어요. 예. 추가돼야 되나 싶긴 하네요. 거기에다 링크 Good.\r\nMonica Kim: 네. 그리고 만약에 그 가이드가 생기면은 저희 플레이그라운드에 뭐 링 버튼을 그 어떻게 인정하는지 보내는지 온체인으로 알려 줘야 되는 거 아닌가 싶어서.\r\n \r\n \r\n00:12:25\r\n \r\nMonica Kim: 근데 저번에 그때 뭐 쉐이크 님 얘기하신 걸로 제 기억에는 아예 모르는 그런 사람 대상 했었던 것 같아서 그러면은 그런 사람들은 기본적으로 다 쓸 줄 아는 건가 싶어 가지고\r\nAle Son: 네. 뭐 그래도 그 예시에 대한 그거는 보여 주긴 해야 될 거 같아요. 예.\r\nMonica Kim: 어 그러면음 음. 구글 제가 지금 남은 업무를 정리를 해 볼게요. 구글 폼이랑 그 가이드 그 온체인으로 보내는 가이드라고 하면 될까요?\r\nAle Son: 어 예 그 프루프를 제출하는 법 예 원체인으로 아 점점 너무 어려워지는 거 같은데\r\nMonica Kim: 저는 최근에 제이크 님이 공유해 주신 그 프루프 뭐 그 URL 하나 있었잖아요.\r\nAle Son: 네. 네.\r\nMonica Kim: 전 그거 봤는데 그게 뭔지 되게 당황스럽거든요. 아, 네. 고 눌러데\r\nAle Son: 사실 이거 타이틀 이런 거부터가이 G 이해가 없으면은 뭐 베리파이어 이런 거 이해가 안 되잖아요.\r\n \r\n \r\n00:13:45\r\n \r\nAle Son: 뭔지.\r\nMonica Kim: 이걸로 뭘 뭘 한다는 건지 사실 저는 하나도 전혀 모르겠어 가지고\r\nAle Son: 전 좀 어려운 거 같은데.\r\nMonica Kim: 그러면은음 지금까지 얘기한 걸로 남은 업무가 이거 관련해서 일단 노션이랑 웹 맞추는 거 노션 일차적으로 그렇게 맞추고 나서 리뷰 요청하는 거 이거는 제가 어 오늘 하고 리뷰 해 달라고 해 볼게요 한번.네\r\nAle Son: 아, 예. 예.\r\nMonica Kim: 네. 오늘 한번 해 볼게요. 그리고 두 번째가 이제 가이드랑 그리고 구글폼인 것 같아요.\r\nAle Son: 네. 네.\r\nMonica Kim: 네. 그래서 알리 님 가이드\r\nAle Son: 어, 가이드는 제가 할게요. 예.\r\nMonica Kim: 네.\r\nAle Son: 그 제가 쓴게 나을까?\r\nMonica Kim: 네. 그리고 구글 폼은 사실 뭐 일단 노션에 맞춘 그 내용 피드백 받고 나서 그거 기반으로 구글폰 어\r\nAle Son: 네.\r\nMonica Kim: 뭐든지는 쭉 하면 돼서 뭐네 되지\r\nAle Son: 구글에\r\nMonica Kim: 않을까요?\r\nAle Son: 그냥 그거를 질문으로 바꾸면 되니까.\r\n \r\n \r\n00:15:26\r\n \r\nMonica Kim: 네.\r\nAle Son: 네.\r\nMonica Kim: 네. 네. 그거는 그냥 간단할\r\nAle Son: 저희\r\nMonica Kim: 거\r\nAle Son: 예전에\r\nMonica Kim: 같아요.\r\nAle Son: 브릿지 할 때 그냥 그 느낌으로 가면 될 거 같아. 예.\r\nMonica Kim: 네. 그러면은 일단 제가 노션이랑 그걸 빨리 맞추고 리뷰를 요청할게요. 오늘 그래야 받을 수 있으니까.\r\nAle Son: 네. 알겠습니다. 아.\r\nMonica Kim: 네.\r\nAle Son: 아, 일단 다시 플레이그라운드 하러 가봐야겠네. 새로 만들어야서.\r\nMonica Kim: 네. 아, 그 모다리랑 막 이런 것도 해야 되잖아요. 또.\r\nAle Son: 네. 하고 아예 이제 새로 또 도커 만들어서 테스트해 보해야 돼 가지고요. 예. GP 윈도우\r\nMonica Kim: 아.\r\nAle Son: 기준으로\r\nMonica Kim: 아.\r\nAle Son: 좀 잘 될지 모르게. 예.\r\nMonica Kim: 아. 아. 그리고 이거 저희 토카막 내부 인어는 에어드랍 그 포함돼요? 안 되죠.\r\n \r\n \r\n00:16:25\r\n \r\nAle Son: 그거는 되게 얘기를 해 봐야겠는데 근데 뭐 이거를 퍼블릭하게 하기 전에 인터널로 조그맣게 해봐도 저는 좋을 것 같긴 하고이 앱 자체가\r\nMonica Kim: 네.\r\nAle Son: 어 되게 좀 환경을 많이 탈 거예요 제가 볼 때는. 그래서\r\nMonica Kim: 음.\r\nAle Son: 좀 공개하기 전에 뭐 짧게라도 해서 버그를 좀 잡고 가면 더 좋지 않을까 싶어 가지고\r\nMonica Kim: 아 저희 인터넷 테스트 이렇게 하는 것처럼 아네 그것도\r\nAle Son: 윈도우 환경에서 좀 많이 써 봐야 되. 윈도우가 워낙 개백처럼 환경이 통일되지 않고 막 다하다 보니까. 그리고\r\nMonica Kim: 아네\r\nAle Son: 이거를 테스트를 저희 참여한 사람들도 대부분 안 윈도우일 거예요. 그래서 그것 때문에 예. 좀 해보고 싶긴 한데 이거 얘기를 한번 해 봐야 될 것 같아. 지금 제가 이걸 너무 길게 하는 걸 원하지 않는 거 같아서.\r\nMonica Kim: 음. 네. 알겠습니다.\r\n \r\n \r\n00:17:18\r\n \r\nMonica Kim: 그러면 우선네 그럼 그거는 내일 물어보면 될 거 같아요. 콜에서\r\nAle Son: 예. 온체인 하는 것도 내일 좀 얘기를 해보고 결정하면 좋을 것 같아요. 저는 좀 그 정도 의미가 있을까 싶어 가지고. 예.\r\nMonica Kim: 음. 네. 알겠습니다.\r\nAle Son: 아이고.\r\nMonica Kim: 근데\r\nAle Son: 네.\r\nMonica Kim: 만약에 그걸 진짜로 가스비 메인넷에서 하면 무조건 그 가스비내는 방법밖에 없는 거 아니에요?\r\nAle Son: 어, 온체인 검증을 해야. 예. 온체인을 올려야 되니까 방법이 없죠. 유저 뭐 저희가 받아서 올려 준 건 사실 네. 좀 의미가 덜하니까 유저가 직접서야 되는 거 말고는 딱히 딴게 있나 모르겠어요. 예.\r\nMonica Kim: 음. 네. 알겠습니다. 네. 저 저 그 노션 링크 한 번만 공유 다시 해 주시면 안 돼요?\r\nAle Son: 아 그니음 지금 DM으로 보내 드릴게요.\r\n \r\n \r\n00:18:44\r\n \r\nMonica Kim: 아, 네. 네. 저도 확인해 볼게요. 그럼 저 메디랑 제이크 님 핑해 가지고음 리뷰해 달라고 얘기할게요.\r\nAle Son: M 아, 온체인을 저희가 잠시만요. 대시하는 그런 걸일 수도 있을 것 같아요. 예.\r\nMonica Kim: 어.\r\nAle Son: 아, 이거는 내일 제이크랑 다시\r\nMonica Kim: 아.\r\nAle Son: 한번 얘기해 보죠. 말이 애매하네요.\r\nMonica Kim: 아.\r\nAle Son: 예. 예.\r\nMonica Kim: 네. 저희가 온체인에서 검증을 해 주는 거네요. 그 제이크 님이 써 준 그 답변 중을 제가 활해서 보니까\r\nAle Son: 네. 네.\r\nMonica Kim: 그 당신이 우리에게 GKP를 보내주면 우리가 그것을 온체인에서\r\nAle Son: 아.\r\nMonica Kim: 검증할 것입니다.\r\nAle Son: 아 그러면은 뭐 유저가내는 건 없는 저희가 대신 해 주는 거네요. 그러니까 온체인이랑\r\nMonica Kim: 어디\r\nAle Son: 오프체인 거 예 저희가 모아서 트랜잭션 올리는 거 아 그러면은 이거 가이드는 필요 없습니다.\r\n \r\n \r\n00:20:16\r\n \r\nMonica Kim: 필요\r\nAle Son: 예\r\nMonica Kim: 없나? 왜요? 어\r\nAle Son: 저희가\r\nMonica Kim: 그러면은\r\nAle Son: 거니까 예\r\nMonica Kim: 어네\r\nAle Son: 그래서 저희가 올리고 이거를 수동으로 그때그때 제가 올리면 될 거 같아요. 검증이 끝난 거. 네.\r\nMonica Kim: 아니 근데 저는 궁금한게 저희 앱에서 물 탱크가 이제 찼어요. 그래서 이제 마지막에 그 완료 모달도 확인을 했어요.\r\nAle Son: 네.\r\nMonica Kim: 그다음에 뭘 그러면은 복사해서을\r\nAle Son: 아, 복사는\r\nMonica Kim: 저희한\r\nAle Son: 아니고 아마 자동으로 전송되는 코드를 제가 플레이그라운드에 심어야 될 것 같아요. 그\r\nMonica Kim: 아네\r\nAle Son: 이거면은 이제 서브및\r\nMonica Kim: 네.\r\nAle Son: 이거 누르면은 이게 뭐 파일 크기가 크진 않거 정도라서\r\nMonica Kim: 네.\r\nAle Son: 생성 프로가 크진 않 이거를 누르면은 저희가 어디 지정한 웹지에 이렇게 저장되게\r\nMonica Kim: 아.\r\nAle Son: 뭐 근데 이제\r\nMonica Kim: 어.\r\n \r\n \r\n00:21:15\r\n \r\nMonica Kim: 그러면 유전은 어떻게 알아요? 프루프에서네\r\nAle Son: 네네\r\nMonica Kim: 개.\r\nAle Son: 근데 이게 본인 건지를 알려면 여기 앞에서 해서\r\nMonica Kim: 뭐?\r\nAle Son: 뭔가 자기 지갑 주소나 그런 걸 넣는게 있어야 되나 싶긴 한데 이거는 좀 얘기를 해 봐야겠네요. 예. 프식별을 를\r\nMonica Kim: 어 그럼 뭔가 앞뒤가 안 맞는데 여기이 프루프가 저희가 보기 위함이 아니라 참여한 사람들이 보는 건데 네. 아, 아니면 제이크 님 지금 슬렉에 계신데 한번 지금 같이 이야기해 볼까요? 또 내일 어차피 오후 늦게여 가지고 시간이\r\nAle Son: 아, 네.\r\nMonica Kim: 너무\r\nAle Son: 네. 예. 지금 해보죠. 예. 그게 좋을 것 같네. 특히 코멘트에는 음.\r\nMonica Kim: 어 제가 말 걸 볼까요? 말 초대할까요?\r\nAle Son: 제가 지금 DM 보내 볼게요.\r\nMonica Kim: 아, 네.\r\nAle Son: 가능하다고 하시네요. 자, 링크를고\r\n \r\n \r\n00:23:28\r\n \r\nMonica Kim: 요새 날씨 너무 습하지 않아요?\r\nAle Son: 그래서 안 나오고 있어요. 아, 어제 비 오는지도 몰랐어요. 계속 집에 있으니까.\r\nJake Jang: 안녕하세요.\r\nAle Son: 네. 안녕하세요. 지금 화면 보이시죠? 제가 지금 공유하고\r\nJake Jang: 네.\r\nAle Son: 있는 거. 그\r\nJake Jang: 네.\r\nAle Son: 저희 플레이그라운드에 이제 물탱카 참면 마지막에이 모다를 띄울 건데 일단은 온체인으로 저희가 받아서 모아 가지고 저희가 온체인 그 증명하는 걸로는 지금 확정이 된 거죠.\r\nJake Jang: 네.\r\nAle Son: 그러면은이 프루프를 서브밋 할 때이 유저의 약간 아이피케이션이 돼야 되잖아요. 그 거와 관련돼서 정보를 더 받아야 되는게 아닌지 싶어 가지고요.이 프루프를\r\nJake Jang: 네. 네. 뭐라고요? 뭐 뭐라고요?\r\nAle Son: 얘도이 프루프를 제출할 때이 프루프가 어\r\nJake Jang: 네.\r\nAle Son: 누가 냈다라는 정보가 같이 있어야 되지 않나요?\r\n \r\n \r\n00:24:32\r\n \r\nJake Jang: 아, 그렇죠. 그렇죠.\r\nAle Son: 네. 근데 이제 저희 지금 플 예.\r\nJake Jang: 서프로프를 누르면은 그냥 폼으로 가게 하면 안 돼요. 구글 폼으로 가게.\r\nAle Son: 음. 음. 근데이 프루프를\r\nJake Jang: BR\r\nAle Son: 뭐 첨부 파일로 그냥 첨부할게요. 그러면 폼 안에서\r\nJake Jang: 잠자. 예. 예. 아, 죄송해요. 택시 안식가 뭐 말걸어서\r\nAle Son: 어 들리시나요?\r\nJake Jang: 네. 네. 네.\r\nAle Son: 아, 예. 그럼 폼\r\nJake Jang: 죄송합니다.\r\nAle Son: 안에서이\r\nJake Jang: 예.\r\nAle Son: 풀를 뭐 천부 파일로\r\nJake Jang: 예.\r\nAle Son: 넣게 하자. 그런 말씀이신가요?\r\nJake Jang: 네. 왜냐 그게 더 안전할 것 같은게 지금\r\nAle Son: 음.\r\nJake Jang: 우리가 여기서 앱으로 앱을 통해서 뭘 파일을 보내는 거를 해 버리면은 위험하죠, 그거는.\r\nAle Son: 음.\r\nJake Jang: 네. 그러니까 내 내 로컬 파일을이 어디 어딘가로 보내는 거니까 그건 되게 위험한 거잖아요.\r\n \r\n \r\n00:25:36\r\n \r\nAle Son: 음. 네. 아, 알겠습니다. 그러면은이 프루프는이 플레이그라운드 깔린 컨텍스트랑 같은 위치에 그냥 나오게 하고 그거를 압축해서 나오게 하고 그 압축 파일을 올리도록 그냥 할게요.\r\nJake Jang: 네.\r\nAle Son: 예. 홈에다\r\nJake Jang: 네.\r\nAle Son: 예. 하겠습니다.\r\nJake Jang: 그 압축해야 되나요? 그거 9kg일 텐데 아마 음량이\r\nAle Son: 네. 아, 그게 단일 파일인가요? 복수면은 압축하려고 했고 단일 파일이면\r\nJake Jang: 아\r\nAle Son: 네.\r\nJake Jang: 아\r\nAle Son: 네.\r\nJake Jang: 프로퍼 하나만 보내면 돼요. 딴 건 다 필요 없이 프로파 하나.\r\nAle Son: 음. 알겠습니다. 예.\r\nJake Jang: 예. 왜냐면 딴 거는 우리가 트레션 정보만 있으면은 우리가 재생할 수 있거든.\r\nAle Son: 알겠습니다. 이거는\r\nJake Jang: 예.\r\nAle Son: 퓨 버전으로 독 만들면서 이제 한 짜 볼게요. 예. 알겠어. 그러면 예.\r\n \r\n \r\n00:26:30\r\n \r\nAle Son: 모임카님 그렇게 하시죠. 예. 근데 거기에 대한 어떻게 내는지에 대한 예시에 대한 가이드는 제가 좀 만들어야네. 노션을\r\nMonica Kim: 근데 저는 아직도 좀 이해가 안 되는게 여기서 서브미 프루프 버튼을 누르면은 자동으로 뭐 트랜잭션 해시 이런 걸 입력하지 않아도 인증이 된다는 거예요.\r\nAle Son: 아니요. 이거는 그냥 단순히 하이퍼링. 그 제이크님\r\nMonica Kim: 네.\r\nAle Son: 말씀은 이거는 이제 저희 폼 구글 그 폼으로 향하는 단순히 하이퍼링크고\r\nMonica Kim: 네.\r\nAle Son: 그 저기가 이제 폼에 질문 만들 때 파일도 넣게 할 수 있잖아요. 거기에 프루프를 첨보하게 하자라는\r\nMonica Kim: 아 그러면를\r\nAle Son: 뜻입니다.\r\nMonica Kim: 다운받을 수 있게 뭔가 버튼이 버튼이든\r\nAle Son: 뭐\r\nMonica Kim: 뭔가 있어야\r\nAle Son: 프로이 저희 플레이그라운드가 깔려 있는 어\r\nMonica Kim: 네.\r\nAle Son: 그 위치에다가 프루프와 생성되게 해야 될 것 같아요.\r\n \r\n \r\n00:27:26\r\n \r\nAle Son: 예. 이게 다 끝나면은 그럼 이제 그거\r\nMonica Kim: 아,\r\nAle Son: 그냥 이제 뭐 드래그를 하든 뭐 직접 찾아서 붙이든 그런 형태로 갈 것 같아.\r\nMonica Kim: 아,\r\nAle Son: 네.\r\nMonica Kim: 그러면 완료됐을 때 여기서 바로 버튼으로 다운로드는 안 돼요? 그냥 자기가 찾아 들어가게 해야 되는 거예요.\r\nAle Son: 다운로드로 할 수도 있죠. 예.\r\nMonica Kim: 아.\r\nAle Son: 아,\r\nMonica Kim: 아,\r\nAle Son: 그게 그 말씀하신게 그게 좀 더 명확하긴 하겠네요. 예.\r\nMonica Kim: 네.\r\nAle Son: 다운로드.\r\nMonica Kim: 네. 네.\r\nAle Son: 예.\r\nMonica Kim: 다운로드를 그럼 여기서 하는게 맞고 그러면은 저희 지금 에어드랍 이벤트 페이지에서 프루프 메이가 있잖아요.\r\nAle Son: 어, 네.\r\nMonica Kim: 네. 거기에서는 지금 보여지는 정보는 트랜잭션 해시가 있는데 이거는 유저가 내게 어 내 거 해시를 알 수 있는 거예요. 내시를 어떻게 알아요?\r\nAle Son: 이거는 이제이 올린이\r\n \r\n \r\n00:28:22\r\n \r\nJake Jang: 가\r\nAle Son: 해시라서 다시 이제 다른 거고 뭐 저희 폼에 이제 그 본인의 어카운트 주소를 적잖아요. 만약에 그걸 활용해서 추가적으로 표시는 해\r\nJake Jang: Voilà\r\nAle Son: 줄 수 있겠죠. 누가 그루프를 증명한 거다. 예.\r\nJake Jang: ce que\r\nMonica Kim: 아,\r\nJake Jang: vous voulez\r\nMonica Kim: 그러니까 이게이 프로프 메뉴가 있는게 내가 만든 GT가 증명이 됐다라는 거를 보여 주려는 건데 그러면은 만약에 제가 그거를 물탱크 툴가 나와 가지고 했으면 내 건지 어떻게 찾아봐야 돼요?\r\nAle Son: 그거는 저희가 추가적으로 여기 필드를 하나 더 넣어야죠. 어카운트에 해당하는\r\nMonica Kim: 아\r\nAle Son: 네.\r\nMonica Kim: 그러면 그 지갑 주소도 여기 들어갈 수 있게 자리를 그럼 만들어야 되는 거예요.\r\nAle Son: 어카운트.\r\nMonica Kim: 어드레스를\r\nAle Son: 네. 어카운트가 있어야 뭐 본인 건지를 이제 뭐 이거를 하나하나 찾아 들어가면 이걸 볼 줄하는 사람이 아 뭐가 내 건지 알겠다 하지만이 자체의 필터링 기능은 없죠.\r\n \r\n \r\n00:29:17\r\n \r\nAle Son: 이거는 그냥\r\nMonica Kim: 아\r\nAle Son: 얘니까 예.\r\nMonica Kim: 어 아 그럼 여기 트랜잭션 해시 옆에 어드에서 지갑 주소도 추가가 되어야겠네요. 내 건지 확인해 보려면.\r\nAle Son: 네.\r\nMonica Kim: 네.\r\nAle Son: 그게 가장 확실한 그\r\nMonica Kim: 네.\r\nAle Son: 키일 것 같아. 예. 어카운트를\r\nMonica Kim: 아,\r\nAle Son: 넣는\r\nMonica Kim: 네. 네. 이제\r\nJake Jang: 어카운터라고 하지 말고 제출자라고 하죠. 어카운트라고 하면 헷갈리니까. 어카운터라고\r\nAle Son: 네.\r\nJake Jang: 하면은 저 트랜제션의 어카운트인지 무슨 무슨 어카운트인지\r\nAle Son: 네.\r\nJake Jang: 모르니까.\r\nMonica Kim: 어, 그럼 원렛 어드레스 말고 제출자 어드레스 이렇게\r\nJake Jang: 예.\r\nMonica Kim: 하잖아요.\r\nJake Jang: 예. 예. 예. 그렇게 명확하게\r\nAle Son: 출자라고\r\nJake Jang: 확실하게\r\nAle Son: 하는 예. 제출자. 음.\r\nMonica Kim: 네.\r\nJake Jang: 그리고 그 방금 생 생각난 건데 구글 폼에다가 파일 올릴 때 자동으로 바이러스 검사가죠.\r\n \r\n \r\n00:30:17\r\n \r\nAle Son: 네.\r\nJake Jang: 그 구글 폼에다가 파일을 업로드할 때 그러니까 구글 우리가 구글 폼에다가 사용자는 구글 폼에다가 자기 파일을 업로드 해서 우리한테 보낼 거 아니에요.\r\nAle Son: 네. 네.\r\nJake Jang: 그러면 그때 구글 폼이 알아서 바이러스 검사를 하죠.\r\nAle Son: 기본적으로 그 구글 드라이브 올릴 때처럼 비슷하죠. 예. 그런\r\nJake Jang: 네. 그거\r\nAle Son: 가정.\r\nJake Jang: 그것도 체크히체크해야\r\nAle Son: 예.\r\nJake Jang: 될 것 같아요. 얘들이 바이러스 심어서 우리한테 보낼 수도 있으니까.\r\nAle Son: 네. 그래서 그 제 압축을 말씀드린게 그 파일 포맷이 조금만 이상해도 못 올리게 하거든요. 그래서 보통 압축으로 올린 경우만 하 갖고\r\nJake Jang: 아 포맷 상 포맷 아 압축을 해도 압축을 해도 압축된 파일의 바이너리로 또 해킹코드를 삽입할 수 있으니까.\r\nAle Son: 아 그 제가 말씀\r\nJake Jang: 예.\r\nAle Son: 그러니까 구글에서 그 아예 못 올리게 막는 포맷들이 되게 많아요.\r\n \r\n \r\n00:31:13\r\n \r\nJake Jang: 아\r\nAle Son: 예. 프루프\r\nJake Jang: 그러니까\r\nAle Son: 지금\r\nJake Jang: 압축을 해야만\r\nAle Son: 확장를 모르는데\r\nJake Jang: 아 아네\r\nAle Son: 예, 포맷 한번 봐야 될 것 같아요. 예, 그니까\r\nJake Jang: 아네네\r\nAle Son: 되게\r\nJake Jang: 그거 확인해야 될 거 같아요.\r\nAle Son: 조금만 보명적인 포맷이 아니면 아예 업로드나 아니면 뭐 시스템8 이런 건 다니면 못 올리고 예, 그렇게 막아 놨더라고요. 예.\r\nJake Jang: 그 걔들도 우리를 못 믿지만 우리도 걔들을 못 믿으니까 서로\r\nAle Son: 네.\r\nJake Jang: 확실하게\r\nAle Son: 모든 걸\r\nJake Jang: 보안을\r\nAle Son: 올리게 해 놓으면 보안 비용이 너무 커지니까\r\nJake Jang: 예.\r\nAle Son: 아예 필터를 해 놓은 거 같아요. 앞에서. 예. 줄려고.\r\nJake Jang: 그거 그거 확인해야 되고 그리고 FQ에도 하나를 적어주면 좋을 것 같아요. 우리 앱을 믿을 수 있는가?\r\nAle Son: M.\r\nMonica Kim: 그\r\nJake Jang: 우리 앱을 믿을 수 있는가? 저 제 답은 우리 앱을 믿을 필요 없다.\r\n \r\n \r\n00:32:01\r\n \r\nJake Jang: 오퍼라인 못 믿겠으면은 네트워크 연결 끊고 플레이그라운드 실행하고 삭제하고 다시 연결해라. 그렇게 해도 되죠. 오프라인해 해도 되잖아요.\r\nAle Son: 어 도커만 다운로드 받았으면 상관없어요.\r\nJake Jang: 네.\r\nAle Son: 도코를 근데 안 받았으면은 그때까지는 네트워크 연결이 필요하고\r\nMonica Kim: 아, 그러니까 인터넷 연결 없이 우리 건 된다라는 거예요.\r\nJake Jang: 네. 그러니까 우리 예 못 믿겠으면은\r\nMonica Kim: 네.\r\nJake Jang: 못 믿겠으면은 네가 믿을 수 없으면은 인터넷 연결\r\nAle Son: M.\r\nJake Jang: 끊고 이벤트에 참여해라고\r\nMonica Kim: 음. 음. 네. 이거는 내용 정리해서 추가해 둘게요. 어, 그리고 그\r\nAle Son: 어봐.\r\nMonica Kim: 안에 내용, 뭐 세부적인 내용들은 저희 최근에 마지막에 노션에 정리했던 거 기준으로 일단 반영하고\r\nJake Jang: 7\r\nMonica Kim: 그 내용, 뭐 영어 이런게 뭐 잘 제대로 적혀 있는지 제가 제이크 님이랑 매디핑 해 가지고 어, 리뷰\r\n \r\n \r\n00:33:14\r\n \r\nAle Son: Ah.\r\nMonica Kim: 요청 드릴게요.\r\nJake Jang: suspect\r\nMonica Kim: 네. 근데 이런 자 이런 세부적인 주의 상황 같은 경우에는 나중에 변경될 수도 있는 거 그거 연두하고면 될 거 같아.\r\nJake Jang: 이거 노트 이거 저렇게 확정된 거예요?\r\nMonica Kim: 어, 아니에요. 이거 제일 초안에 작성했던 노트 그대로 한 거여서\r\nJake Jang: 네.\r\nMonica Kim: 내용이 당연히 저희 거에 맞게 얼마든지 변경 가능해요.\r\nAle Son: 여기랑\r\nJake Jang: 네. 네.\r\nAle Son: 뭐 여기도 바뀔 거고 여기도 예 좀 다 확정해야\r\nJake Jang: 네.\r\nAle Son: 되는\r\nJake Jang: 네.\r\nAle Son: 많아서\r\nJake Jang: 네.\r\nAle Son: 다시 한번\r\nJake Jang: 알겠습니다.\r\nAle Son: 얘기를 해 봐야 될 것 같아. 예.\r\nJake Jang: 네. 네.\r\nAle Son: 그러면 혹시 모린카님 더 필요하신 거 있으신가요?\r\nMonica Kim: 아니요. 괜찮습니다.\r\nAle Son: 네. 네. 알겠습니다. 그러면 예. 내일 다시 보시죠. 예. 감사합니다.\r\nMonica Kim: 감사합니다,\r\n \r\n \r\n00:34:16\r\n \r\nAle Son: 네. 감사합니다.\r\nMonica Kim: 알래 님.\r\nAle Son: 네.\r\nMonica Kim: 네. 그 보니까 그러면 어 뭐지? 버튼 명을 좀 정리를 해야 될 거 같아 가지고\r\nAle Son: 버튼이란게\r\nMonica Kim: 그\r\nAle Son: 이거 말씀하신 건가요?\r\nMonica Kim: 여기도 그렇고 플레이그라운드에 그 모달이 있잖아요. 그 마지막 그 GKP 완료되면 뜨는 모달\r\nAle Son: 아, 네. 네.\r\nMonica Kim: 여기서\r\nAle Son: 이게\r\nMonica Kim: 좀 애매해 가지고\r\nAle Son: 스타트\r\nMonica Kim: 다운로드가\r\nAle Son: 나오는 이게 왜 있는 거죠? 근데\r\nMonica Kim: 아 이거 만들 당시에 일단 버튼을 두 개를 넣어 준 거예요. 앞에 거랑 동일하게.\r\nAle Son: 아\r\nMonica Kim: 네.\r\nAle Son: 그러면은이 느낌이 아니고 그 원스텝 투 스텝 느낌으로 가면 될 거 같아. 다운로드 받고 그다음에 다운로드 다 받아지면은 제출하는 그런데 저희가 기존에 썼던 거는 이제 다운로드 완료해서 끝나잖아요. 스타일들이. 어\r\n \r\n \r\n00:35:09\r\n \r\nMonica Kim: 네.\r\nAle Son: 이거 말고 저희 새로 만들었던 거. 예. 여기 음. 이런 상태에서 밑에 서브 붙이는 건 좀 어색할까요? 약간\r\nMonica Kim: 네. 아, 근데 어, 그니까 뭐 디테일한 가이드가 아니라 뭔가 이미지가 아니더라도 텍스트로라도 그걸 어, 이걸 다운 받고 그 파일을 인증 첨부를 해야 된다라고 어딘가 있어야 되지 않아요, 내용이.\r\nAle Son: 네. 네.\r\nMonica Kim: 그\r\nAle Son: 그거를 여기다 설명을 해 줘야 될 것 같아. 지금 모에. 예. 이거를\r\nMonica Kim: 아 근데\r\nAle Son: 다운받아서 제출해야 된다라는\r\nMonica Kim: 그럼 거기 그 내용의 문장을 하나 더 추가하고\r\nAle Son: 그 부분을 좀 볼드로 강조를 해 줘야 될 것 같아요. 예.\r\nMonica Kim: 그걸 추가하고 이거는 어 다운로드가 맞는 거 같아요. 스타트\r\nAle Son: 음. 네.\r\nMonica Kim: 나오 다운로드를 해야 되니까.\r\nAle Son: 그러면이 다운로드 해 놓고 서브밋은 처음에 비활성화로\r\n \r\n \r\n00:36:19\r\n \r\nMonica Kim: 네.\r\nAle Son: 해 두죠.\r\nMonica Kim: 네. 네.\r\nAle Son: 그 다운로드 받게 되면은 그다음에 서브미 활성화되고음\r\nMonica Kim: 근데 이게 굳이 비활성화로 될 필요 없지 않아요? 활성화해놔도 들어가서 뭐 들어가 보고 싶을 수도 있잖아요. 다운로드 하기 전에.\r\nAle Son: 아 예 그렇게 하죠. 예.\r\nMonica Kim: 그러면 여기 문구 하나 추가하고 버튼 명하는 걸로 할게요.\r\nAle Son: 네. 네.\r\nMonica Kim: 어, 네. 여기 그 한 줄 그거 추가해 드릴게요.\r\nAle Son: 네. 네.\r\nMonica Kim: 네. 아, 갑자기 뭔가 복잡하네. 네. 알겠습니다. 네. 그러면 일단 여기까지는 저는음 된 거 같아요. 공부만 없는 거 같아요.\r\nAle Son: 어 예요.\r\nMonica Kim: 네. 알겠습니다.\r\nAle Son: 계속\r\nMonica Kim: 네.\r\nAle Son: 늘어난 느낌인데\r\nMonica Kim: 그죠? 아. 아, 네.\r\nAle Son: 일단 그 휴가 다녀오실 때까지 최대한 해 볼게요.\r\nMonica Kim: 아, 근데 아직 뭐 뭐 뭐 그란트 받아진 것도 아니지 않아요, 아직은.\r\nAle Son: 네. 네.\r\nMonica Kim: 어, 그죠.\r\nAle Son: 아마 뭐 다음 주쯤에 신청하지 않을까 싶은데 예.\r\nMonica Kim: 음.\r\nAle Son: 이런\r\nMonica Kim: 네.\r\nAle Son: 얘기를 해 봐야 될 거 제가. 예.\r\n \r\n \r\n00:38:18 후 스크립트 작성이 종료되었습니다.\r\n\r\n\r\n수정 가능한 이 스크립트는 컴퓨터에서 생성되었으며 오류가 포함되어 있을 수 있습니다. 생성 후에도 사용자가 텍스트를 변경할 수 있습니다.",
    "created_by": "Ale"
  }